# Question: Analyse a small dataset using python, documenting the step by step process of the data analysis journey.

### 1. importing liberary

In [2]:
# uploading pandas liberary.
import pandas as pd

### 2. uploading dataset

In [3]:
# importing dataset
auwal = pd.read_excel(r"C:\Users\ewoo\Documents\dataset.xlsx")

### 3. viewing your dataset

In [4]:
# printing the dataset
print(auwal)

            Names  salary  Staff no       Posiion Gender
0      Auwal Musa  100000      2134     prorietor      M
1    Haruna Shehu   70000      3434     principal      M
2    jafar Yakubu   50000      5453  exam officer      M
3   fatima hassan   45000      4576    accountant      F
4   maryam hassan   30000      5647       teacher      F
5  willian david    25000      4444       teacher      M
6       sani musa   20000      4324       teacher      M
7    lawan  jafar   18000      4321       teacher      M
8  hassana hassan   15000      3213       teacher      F

### 4. viewing first 3 element of the dataset

In [6]:
# printing header
auwal.head(3)

          Names  salary  Staff no       Posiion Gender
0    Auwal Musa  100000      2134     prorietor      M
1  Haruna Shehu   70000      3434     principal      M
2  jafar Yakubu   50000      5453  exam officer      M

### 5. viewing last 5 element of the dataset

In [8]:
# printing tail
auwal.tail()

            Names  salary  Staff no  Posiion Gender
4   maryam hassan   30000      5647  teacher      F
5  willian david    25000      4444  teacher      M
6       sani musa   20000      4324  teacher      M
7    lawan  jafar   18000      4321  teacher      M
8  hassana hassan   15000      3213  teacher      F

### 6. viewing information of the data set

In [11]:
# viewing informatioin
auwal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Names     9 non-null      object
 1   salary    9 non-null      int64
 2   Staff no  9 non-null      int64
 3   Posiion   9 non-null      object
 4   Gender    9 non-null      object
dtypes: int64(2), object(3)
memory usage: 492.0+ bytes

### 7. viewing descrption

In [12]:
# viewing description
auwal.describe()

              salary     Staff no
count       9.000000     9.000000
mean    41444.444444  4171.777778
std     28373.011433  1102.092303
min     15000.000000  2134.000000
25%     20000.000000  3434.000000
50%     30000.000000  4324.000000
75%     50000.000000  4576.000000
max    100000.000000  5647.000000